TensorDT/uCOS-II_MC9S12DG256/Source/MC9S12DG256/os_cpu_c.c
/*
*********************************************************************************************************
*                                              uC/OS-II
*                                        The Real-Time Kernel
*
*                    Copyright 1992-2020 Silicon Laboratories Inc. www.silabs.com
*
*                                 SPDX-License-Identifier: APACHE-2.0
*
*               This software is subject to an open source license and is distributed by
*                Silicon Laboratories Inc. pursuant to the terms of the Apache License,
*                    Version 2.0 available at www.apache.org/licenses/LICENSE-2.0.
*
*********************************************************************************************************
*/


/*
*********************************************************************************************************
*
*                                         MC9S12 Specific Code
*                                          Banked Memory Model
*                                            Codewarrior 4.x
*
* Filename : os_cpu_c.c
* Version  : V2.93.00
*********************************************************************************************************
*/
#include "mc9s12dg256_banking.h"
#include  "ucos_ii.h"

typedef union {
    INT16U value;
    struct {
        INT8U byte1;
        INT8U byte0;
    } value16_ST;
} value16_UN;


typedef union {
    INT32U addr;
    struct {
        INT8U byte3;
        INT8U byte2;
        INT8U byte1;
        INT8U byte0;
    } addr32_ST;
} addr32_UN;

/*
*********************************************************************************************************
*                                         PROTOTYPES
*********************************************************************************************************
*/

_NEAR void  OSTaskAbort(void);

/*
*********************************************************************************************************
*                                           LOCALS
*********************************************************************************************************
*/

#if OS_TMR_EN > 0
static  INT16U  OSTmrCtr;
#endif

static INT16U CntrTick = 0;

/*
*********************************************************************************************************
*                                       OS INITIALIZATION HOOK
*                                            (BEGINNING)
*
* Description: This function is called by OSInit() at the beginning of OSInit().
*
* Arguments  : none
*
* Note(s)    : 1) Interrupts should be disabled during this call.
*********************************************************************************************************
*/
#if OS_CPU_HOOKS_EN > 0 && OS_VERSION > 203
_NEAR void  OSInitHookBegin (void)
{
#if OS_TMR_EN > 0
    OSTmrCtr = 0;
#endif
}
#endif

/*
*********************************************************************************************************
*                                       OS INITIALIZATION HOOK
*                                               (END)
*
* Description: This function is called by OSInit() at the end of OSInit().
*
* Arguments  : none
*
* Note(s)    : 1) Interrupts should be disabled during this call.
*********************************************************************************************************
*/
#if OS_CPU_HOOKS_EN > 0 && OS_VERSION > 203
_NEAR void  OSInitHookEnd (void)
{
}
#endif


/*
*********************************************************************************************************
*                                          TASK CREATION HOOK
*
* Description: This function is called when a task is created.
*
* Arguments  : ptcb   is a pointer to the task control block of the task being created.
*
* Note(s)    : 1) Interrupts are disabled during this call.
*********************************************************************************************************
*/
#if OS_CPU_HOOKS_EN > 0
_NEAR void  OSTaskCreateHook (OS_TCB *ptcb)
{
#if OS_APP_HOOKS_EN > 0
    App_TaskCreateHook(ptcb);
#else
    (void)ptcb;                                                         /* Prevent compiler warning                                 */
#endif
}
#endif

/*
*********************************************************************************************************
*                                           TASK DELETION HOOK
*
* Description: This function is called when a task is deleted.
*
* Arguments  : ptcb   is a pointer to the task control block of the task being deleted.
*
* Note(s)    : 1) Interrupts are disabled during this call.
*********************************************************************************************************
*/
#if OS_CPU_HOOKS_EN > 0
_NEAR void  OSTaskDelHook (OS_TCB *ptcb)
{
#if OS_APP_HOOKS_EN > 0
    App_TaskDelHook(ptcb);
#else
    (void)ptcb;                                                         /* Prevent compiler warning                                 */
#endif
}
#endif

/*
*********************************************************************************************************
*                                             IDLE TASK HOOK
*
* Description: This function is called by the idle task.  This hook has been added to allow you to do
*              such things as STOP the CPU to conserve power.
*
* Arguments  : none
*
* Note(s)    : 1) Interrupts are enabled during this call.
*********************************************************************************************************
*/
#if OS_CPU_HOOKS_EN > 0 && OS_VERSION >= 251
_NEAR void  OSTaskIdleHook (void)
{
#if OS_APP_HOOKS_EN > 0
    App_TaskIdleHook();
#endif
}
#endif


/*
*********************************************************************************************************
*                                           TASK RETURN HOOK
*
* Description: This function is called when a task is returned.
*
* Arguments  : ptcb   is a pointer to the task control block of the task being returned.
*
* Note(s)    : 1) Interrupts are disabled during this call.
* Added 28-Oct-2020 GPM
*********************************************************************************************************
*/
#if OS_CPU_HOOKS_EN > 0
_NEAR void  OSTaskReturnHook (OS_TCB *ptcb)
{
#if OS_APP_HOOKS_EN > 0
    App_TaskReturnHook(ptcb);
#else
    (void)ptcb;                                                         /* Prevent compiler warning                                 */
#endif
}
#endif


/*
*********************************************************************************************************
*                                           STATISTIC TASK HOOK
*
* Description: This function is called every second by uC/OS-II's statistics task.  This allows your
*              application to add functionality to the statistics task.
*
* Arguments  : none
*********************************************************************************************************
*/

#if OS_CPU_HOOKS_EN > 0
_NEAR void  OSTaskStatHook (void)
{
#if OS_APP_HOOKS_EN > 0
    App_TaskStatHook();
#endif
}
#endif


/*
*********************************************************************************************************
*                                        INITIALIZE A TASK'S STACK
*
* Description: This function is called by either OSTaskCreate() or OSTaskCreateExt() to initialize the
*              stack frame of the task being created.  This function is highly processor specific.
*
* Arguments  : task          is a pointer to the task code
*
*              pdata         is a pointer to a user supplied data area that will be passed to the task
*                            when the task first executes.
*
*              ptos          is a pointer to the top of stack.  It is assumed that 'ptos' points to
*                            a 'free' entry on the task stack.  If OS_STK_GROWTH is set to 1 then
*                            'ptos' will contain the HIGHEST valid address of the stack.  Similarly, if
*                            OS_STK_GROWTH is set to 0, the 'ptos' will contains the LOWEST valid address
*                            of the stack.
*
*              opt           specifies options that can be used to alter the behavior of OSTaskStkInit().
*                            (see uCOS_II.H for OS_TASK_OPT_???).
*
* Returns    : Always returns the location of the new top-of-stack' once the processor registers have
*              been placed on the stack in the proper order.
*
* Note(s)    : 1) XIRQ interrupts are disabled when your task starts executing. You can change this by
*                 clearing BIT6 in the CCR.
*              2) The STOP instruction is disabled when your task starts executing.  You can change this
*                 by clearing BIT7 in the CCR.
*              3) The other interrupts (i.e. maskable interrupts) are enabled when your task starts
*                 executing.  You can change this by setting BIT4 in the CCR.
*              4) You can change pass the above options in the 'opt' argument.  You MUST only use the
*                 upper 8 bits of 'opt' because the lower bits are reserved by uC/OS-II.  If you make
*                 changes to the code below, you will need to ensure that it doesn't affect the behaviour
*                 of OSTaskIdle() and OSTaskStat().
*              5) Registers are initialized to make them easy to differentiate with a debugger.
*              6) All your tasks are assumed to be in NON-PAGED memory.  However, the tasks can call
*                 functions in PAGED memory and if a context switch occurs, the proper page will be
*                 saved/restored by uC/OS-II.  Page #0 is stored onto the task's stack as a 'dummy'
*                 value.
*********************************************************************************************************
*/
//#define ORIG_VERSION

#ifdef ORIG_VERSION
_NEAR OS_STK *OSTaskStkInit (void (*task)(void *pd), void *p_arg, OS_STK *ptos, INT16U opt)
{
    INT8U  *bstk;


    (void)&opt;                                     /* 'opt' is not used, prevent warning                     */

    bstk    = (INT8U *)ptos;                        /* Load stack pointer                                     */


    *--bstk = (INT8U)(((INT32U)OSTaskAbort) >>  8); /* Task return address low  (simulated calling function)  */
    *--bstk = (INT8U)(((INT32U)OSTaskAbort) >> 16); /* Task return address high (simulated calling function)  */
    *--bstk = (INT8U)(((INT32U)OSTaskAbort));       /* Task return address page (simulated calling function)  */


                                                    /* Format: PCH:PCL:PPAGE                                  */
    *--bstk = (INT8U)(((INT32U)task) >> 8);         /* Task start address PCL                                 */
    *--bstk = (INT8U)(((INT32U)task) >> 16);        /* Task start address PCH.                                */


    *--bstk = (INT8U)0x22;                          /* Y Register low                                         */
    *--bstk = (INT8U)0x22;                          /* Y Register high                                        */


    *--bstk = (INT8U)0x11;                          /* X Register low                                         */
    *--bstk = (INT8U)0x11;                          /* X Register high                                        */


    *--bstk = (INT8U)(((INT16U)p_arg) >> 8);        /* A register / D register high task argument             */
    *--bstk = (INT8U) ((INT16U)p_arg);              /* B register / D register low  task argument             */


    *--bstk = (0xC0);                               /* CCR Register (Disable STOP instruction and XIRQ)       */


    *--bstk = (INT8U)(((INT32U)task));              /* Save the PPAGE register                                */

    return ((OS_STK *)bstk);                        /* Return pointer to new top-of-stack                     */
}

#else
_NEAR OS_STK *OSTaskStkInit (
    void (*task)(void *pd),       // task start address
    void *p_arg,                  // task argument pointer
    OS_STK *ptos,                 // task top of stack pointer
    INT16U opt)                   // options
{
    INT8U  *bstk;
    addr32_UN addrTemp_UN;
	value16_UN valueTemp_UN;
//    OS_CPU_SR cpu_sr;

    (void)&opt;                                  // 'opt' is not used, prevent warning

    bstk    = (INT8U *)ptos;                     // Load stack pointer

    // Simulate call to function with an argument (i.e., p_arg)
    // For MC9S12DG256, the argument pointer would be passed via the "D" register
    // (not on the stack) so all we need to stack is a "return address".
    addrTemp_UN.addr = (INT32U)OSTaskAbort;
    *--bstk = addrTemp_UN.addr32_ST.byte0;       // address low byte  (simulated calling fn)
    *--bstk = addrTemp_UN.addr32_ST.byte1;       // address high byte (simulated calling fn)
    // Not sure if we need the page
    *--bstk = addrTemp_UN.addr32_ST.byte2;       // address page      (simulated calling fn)

    // Simulate ISR vector by stacking the registers that are automatically pushed
    // by the processor when it recognizes and starts servicing an interrupt
    addrTemp_UN.addr = (INT32U)task;
    *--bstk = addrTemp_UN.addr32_ST.byte0;       // address low byte  (task)
    *--bstk = addrTemp_UN.addr32_ST.byte1;       // address high byte (task)

    *--bstk = (INT8U)0x22;                       // Y Register low byte  (simulated)
    *--bstk = (INT8U)0x22;                       // Y Register high byte (simulated)

    *--bstk = (INT8U)0x11;                       // X Register low byte  (simulated)
    *--bstk = (INT8U)0x11;                       // X Register high byte (simulated)

    valueTemp_UN.value = (INT16U)p_arg;
    *--bstk = valueTemp_UN.value16_ST.byte1;     // A register / D register high task arg
    *--bstk = valueTemp_UN.value16_ST.byte0;     // B register / D register low  task arg

    *--bstk = 0xC0;                              // CCR Register (Disable STOP instruction and XIRQ)
                                                 //   (NOT the actual current CCR value)

    *--bstk = addrTemp_UN.addr32_ST.byte2;       // address page (task)
    
    return ((OS_STK *)bstk);                     // Return pointer to new top-of-stack
}

#endif



/*
*********************************************************************************************************
*                                           TASK ABORT HANDLER
*
* Description: This function serves as the caller function for all tasks.  If a task accidently returns,
*              the caller will regain control of the CPU and delete the task preventing a system crash..
*
* Arguments  : none
*
* Note(s)    : In uC/OS-II, a task should NEVER exit and should instead call OSTaskDel(OS_PRIO_SELF)
*              when no longer desired.
*********************************************************************************************************
*/

_NEAR void  OSTaskAbort (void)
{
    OSTaskDel(OS_PRIO_SELF);
}


/*
*********************************************************************************************************
*                                           TASK SWITCH HOOK
*
* Description: This function is called when a task switch is performed.  This allows you to perform other
*              operations during a context switch.
*
* Arguments  : none
*
* Note(s)    : 1) Interrupts are disabled during this call.
*              2) It is assumed that the global pointer 'OSTCBHighRdy' points to the TCB of the task that
*                 will be 'switched in' (i.e. the highest priority task) and, 'OSTCBCur' points to the
*                 task being switched out (i.e. the preempted task).
*********************************************************************************************************
*/
#if OS_CPU_HOOKS_EN > 0
_NEAR void  OSTaskSwHook (void)
{
#if OS_APP_HOOKS_EN > 0
    App_TaskSwHook();
#endif
}
#endif

/*
*********************************************************************************************************
*                                           OSTCBInit() HOOK
*
* Description: This function is called by OS_TCBInit() after setting up most of the TCB.
*
* Arguments  : ptcb    is a pointer to the TCB of the task being created.
*
* Note(s)    : 1) Interrupts may or may not be ENABLED during this call.
*********************************************************************************************************
*/
#if OS_CPU_HOOKS_EN > 0 && OS_VERSION > 203
_NEAR void  OSTCBInitHook (OS_TCB *ptcb)
{
#if OS_APP_HOOKS_EN > 0
    App_TCBInitHook(ptcb);
#else
    (void)ptcb;                                                         /* Prevent compiler warning                                 */
#endif
}
#endif


/*
*********************************************************************************************************
*                                               TICK HOOK
*
* Description: This function is called every tick.
*
* Arguments  : none
*
* Note(s)    : 1) Interrupts may or may not be ENABLED during this call.
*********************************************************************************************************
*/
#if OS_CPU_HOOKS_EN > 0
_NEAR void  OSTimeTickHook (void)
{
#if OS_APP_HOOKS_EN > 0
    App_TimeTickHook();
#endif

#if OS_TMR_EN > 0
    OSTmrCtr++;
    if (OSTmrCtr >= (OS_TICKS_PER_SEC / OS_TMR_CFG_TICKS_PER_SEC)) {
        OSTmrCtr = 0;
        OSTmrSignal();
    }
#endif
}
#endif


// Added 28-Oct-2020 GPM
_NEAR void  OSTickISRHandler (void)
{
    // Clear the interrupt by writing a 1 to the channel (timer) 7
    // interrupt flag.
    TFLG1 |= TFLG1_C7F;

    // Increment the output compare so another interrupt is generated
    // at the desired interval.
    TC7   += TMR_TICKS_PER_TMR_INT;
    // Can't the ECT be configured to create a periodic timer? If so,
    // consider doing that.

    // FIX ME!!! Create a module for handling timekeeping and call a
    // function in it to update the clock by MS_PER_TMR_INT.

    ++CntrTick;  // For debugging...

    return;
}
